## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 14 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                             NAME                                             |
|--------|----------------------------------------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.admin_target_group_arn`                                           |
|        | `aws_secretsmanager_secret.api_target_group_arn`                                             |
|        | `aws_secretsmanager_secret.document_download_api_target_group_arn`                           |
|        | `aws_secretsmanager_secret.documentation_target_group_arn`                                   |
|        | `aws_secretsmanager_secret_version.admin_target_group_arn`                                   |
|        | `aws_secretsmanager_secret_version.api_target_group_arn`                                     |
|        | `aws_secretsmanager_secret_version.document_download_api_target_group_arn`                   |
|        | `aws_secretsmanager_secret_version.documentation_target_group_arn`                           |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.32.0/19&quot;]`              |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.64.0/19&quot;]`              |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.96.0/19&quot;]`              |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0c7d18c0c51b28b61&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0c91f7c6b8211904b&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0cecd9e634daf82d3&quot;]` |
| delete | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-003252752c8a83c9f&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0372dd9f5c68cdf14&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0c68946095ba18faf&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret.admin_target_group_arn will be created
  + resource "aws_secretsmanager_secret" "admin_target_group_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "ADMIN_TARGET_GROUP_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.api_target_group_arn will be created
  + resource "aws_secretsmanager_secret" "api_target_group_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "API_TARGET_GROUP_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.document_download_api_target_group_arn will be created
  + resource "aws_secretsmanager_secret" "document_download_api_target_group_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "DOCUMENT_DOWNLOAD_API_TARGET_GROUP_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.documentation_target_group_arn will be created
  + resource "aws_secretsmanager_secret" "documentation_target_group_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "DOCUMENTATION_TARGET_GROUP_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.admin_target_group_arn will be created
  + resource "aws_secretsmanager_secret_version" "admin_target_group_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.api_target_group_arn will be created
  + resource "aws_secretsmanager_secret_version" "api_target_group_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.document_download_api_target_group_arn will be created
  + resource "aws_secretsmanager_secret_version" "document_download_api_target_group_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.documentation_target_group_arn will be created
  + resource "aws_secretsmanager_secret_version" "documentation_target_group_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.32.0/19"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a"
      + description            = "Rule name: 10.0.32.0/19"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.32.0/19"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.64.0/19"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a"
      + description            = "Rule name: 10.0.64.0/19"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.64.0/19"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.96.0/19"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a"
      + description            = "Rule name: 10.0.96.0/19"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.96.0/19"
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-003252752c8a83c9f"] will be destroyed
  # (because key ["subnet-003252752c8a83c9f"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-08b98450aadcf0e33" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a" -> null
      - id                     = "cvpn-assoc-08b98450aadcf0e33" -> null
      - subnet_id              = "subnet-003252752c8a83c9f" -> null
      - vpc_id                 = "vpc-0e02e0295db594518" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0372dd9f5c68cdf14"] will be destroyed
  # (because key ["subnet-0372dd9f5c68cdf14"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-000e9ced6c35f0dda" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a" -> null
      - id                     = "cvpn-assoc-000e9ced6c35f0dda" -> null
      - subnet_id              = "subnet-0372dd9f5c68cdf14" -> null
      - vpc_id                 = "vpc-0e02e0295db594518" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0c68946095ba18faf"] will be destroyed
  # (because key ["subnet-0c68946095ba18faf"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-050d145a83b9cae1f" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a" -> null
      - id                     = "cvpn-assoc-050d145a83b9cae1f" -> null
      - subnet_id              = "subnet-0c68946095ba18faf" -> null
      - vpc_id                 = "vpc-0e02e0295db594518" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0c7d18c0c51b28b61"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0c7d18c0c51b28b61"
      + vpc_id                 = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0c91f7c6b8211904b"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0c91f7c6b8211904b"
      + vpc_id                 = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0cecd9e634daf82d3"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0cecd9e634daf82d3"
      + vpc_id                 = (known after apply)
    }

Plan: 14 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + sentinel_forwarder_cloudwatch_lambda_arn  = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder"
  + sentinel_forwarder_cloudwatch_lambda_name = "sentinel-cloud-watch-forwarder"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main -...
```

</details>
